20231203190807-線性與非線性.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-12-03 Sun 19:09 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>#+title: 線性與非線性</title>
<meta name="author" content="Yung-Chin Yen" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">#+title: 線性與非線性</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org350822f">1. 模型範例</a>
<ul>
<li><a href="#orge2d1dca">1.1. 線性模型(Linear Models)</a></li>
<li><a href="#org69a36d1">1.2. 非線性模型(Nonlinear Models)</a>
<ul>
<li><a href="#orgcaa982d">1.2.1. 常用的 Nonlinear Models</a></li>
<li><a href="#org087791c">1.2.2. Decision Tree</a></li>
<li><a href="#org7fc5955">1.2.3. Ensemble Models</a></li>
<li><a href="#org803c7e7">1.2.4. 選取 model 的考量</a></li>
<li><a href="#org13d61d0">1.2.5. Bagging</a></li>
<li><a href="#orga797fb3">1.2.6. XGBoost</a></li>
<li><a href="#orgc84e940">1.2.7. CNN</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org350822f" class="outline-2">
<h2 id="org350822f"><span class="section-number-2">1.</span> 模型範例</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orge2d1dca" class="outline-3">
<h3 id="orge2d1dca"><span class="section-number-3">1.1.</span> 線性模型(Linear Models)</h3>
</div>
<div id="outline-container-org69a36d1" class="outline-3">
<h3 id="org69a36d1"><span class="section-number-3">1.2.</span> 非線性模型(Nonlinear Models)</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orgcaa982d" class="outline-4">
<h4 id="orgcaa982d"><span class="section-number-4">1.2.1.</span> 常用的 Nonlinear Models</h4>
<div class="outline-text-4" id="text-1-2-1">
</div>
<ol class="org-ol">
<li><a id="org2496a54"></a>Supervised Learning<br />
<div class="outline-text-5" id="text-1-2-1-1">
<ul class="org-ul">
<li>Decision tree</li>
<li>Ensemble models: Random forest, XGBoost</li>
<li>Neural network</li>
</ul>
</div>
</li>
<li><a id="org3e78933"></a>Unsupervised Learning<br />
<div class="outline-text-5" id="text-1-2-1-2">
<ul class="org-ul">
<li>tSNE(t-Distributed Stochastic Neighbor Embedding)</li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-org087791c" class="outline-4">
<h4 id="org087791c"><span class="section-number-4">1.2.2.</span> Decision Tree</h4>
<div class="outline-text-4" id="text-1-2-2">
</div>
<ol class="org-ol">
<li><a id="orge38ec00"></a>example: <a href="https://en.akinator.com">https://en.akinator.com</a><br /></li>
<li><a id="org5833498"></a>要定義很多 rule 才能把 tree 建起來<br /></li>
</ol>
</div>
<div id="outline-container-org7fc5955" class="outline-4">
<h4 id="org7fc5955"><span class="section-number-4">1.2.3.</span> Ensemble Models</h4>
<div class="outline-text-4" id="text-1-2-3">
</div>
<ol class="org-ol">
<li><a id="org7010f17"></a>用多棵樹來決定，做法為<br />
<div class="outline-text-5" id="text-1-2-3-1">
<ol class="org-ol">
<li>Get a set of classifiers, f1(x),f2(x),f3(x),&#x2026;</li>
<li>Aggregate the classifiers (properly)</li>
</ol>
</div>
</li>
</ol>
</div>
<div id="outline-container-org803c7e7" class="outline-4">
<h4 id="org803c7e7"><span class="section-number-4">1.2.4.</span> 選取 model 的考量</h4>
<div class="outline-text-4" id="text-1-2-4">
<ul class="org-ul">
<li>Bias v.s. Variance</li>
<li>Error from bias</li>
<li>Error from variance</li>
<li>Error observed</li>
<li>underfitting v.s. overfitting
overfitting: 完全符合 training data, 但 testing data 效果很差</li>
</ul>
</div>
</div>
<div id="outline-container-org13d61d0" class="outline-4">
<h4 id="org13d61d0"><span class="section-number-4">1.2.5.</span> Bagging</h4>
<div class="outline-text-4" id="text-1-2-5">
</div>
<ol class="org-ol">
<li><a id="org582172e"></a>This approach would be helpful when your model is complex, easy to overfit.<br /></li>
<li><a id="org2baf63d"></a>適用系統:<br />
<div class="outline-text-5" id="text-1-2-5-2">
<ul class="org-ul">
<li>decision tree: 只要樹夠深，可以 train 到 100%，但是對新進來的資料完全無用，即 overfitting</li>
</ul>
</div>
</li>
<li><a id="orgb0631ab"></a>Random Forest<br />
<div class="outline-text-5" id="text-1-2-5-3">
<ul class="org-ul">
<li>將 decision tree 應用到 bagging 的方式</li>
<li>做法：每次從 M 個特徵抽出 m 個來建 decision tree</li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-orga797fb3" class="outline-4">
<h4 id="orga797fb3"><span class="section-number-4">1.2.6.</span> XGBoost</h4>
<div class="outline-text-4" id="text-1-2-6">
</div>
<ol class="org-ol">
<li><a id="orgdce8a63"></a>eXtreme Gradient Boosting<br /></li>
<li><a id="org37f06df"></a>Kaggle 機器學習競賽常用 solution<br /></li>
<li><a id="orgc8dbe1f"></a>為一種集思廣益的策略<br />
<div class="outline-text-5" id="text-1-2-6-3">
<ul class="org-ul">
<li>hello \[E=mc^2\]</li>
<li>test</li>
</ul>
</div>
</li>
<li><a id="org1c9621d"></a>一次一次加入一棵新的 tree,每加一棵新 tree 都要讓 loss 降低<br /></li>
</ol>
</div>
<div id="outline-container-orgc84e940" class="outline-4">
<h4 id="orgc84e940"><span class="section-number-4">1.2.7.</span> CNN</h4>
<div class="outline-text-4" id="text-1-2-7">
</div>
<ol class="org-ol">
<li><a id="org9ddc6ad"></a>目的在減少類神經網路每一個 layer 的 feature 數量，以減化連結複雜度<br /></li>
<li><a id="org98b2018"></a>CNN 主要用來處理圖片: A neuron does not have to see the whole image to discover the pattern.<br /></li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Yung-Chin Yen</p>
<p class="date">Created: 2023-12-03 Sun 19:09</p>
</div>
</body>
</html>